cask_args appdir: '/Applications'

# taps -------------------------------------------------------------------------
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'github/bootstrap'
tap 'homebrew/bundle'
tap 'homebrew/services'

# dependencies -----------------------------------------------------------------
brew 'coreutils'
brew 'go'
brew 'mas'

# gpg --------------------------------------------------------------------------
brew 'openssl'
brew 'gpg'
brew 'gpg2'
brew 'gpg-agent'
brew 'pinentry'
brew 'pinentry-mac'
brew 'gnupg'
brew 'gnupg2'

# image ------------------------------------------------------------------------
brew 'ffmpeg', args: ['with-libass', 'with-fontconfig']
brew 'imagemagick', args: ['with-fontconfig']

# node -------------------------------------------------------------------------
brew 'node'
brew 'node-build'
brew 'nvm'
# brew 'nodenv'

# ruby -------------------------------------------------------------------------
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'

# python -----------------------------------------------------------------------
brew 'python'

# other brews ------------------------------------------------------------------
brew 'duck'
brew 'heroku'
brew 'jq'
brew 'p7zip'
brew 'rename'
brew 'shellcheck'
brew 'switchaudio-osx'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'wget'

# aws --------------------------------------------------------------------------
brew 'awscli'
brew 'amazon-ecs-cli'

# git --------------------------------------------------------------------------
brew 'git'
brew 'hub'
brew 'git-lfs'
brew 'git-extras'
brew 'gist'
brew 'bfg'
brew 'icdiff'

# /Applications ----------------------------------------------------------------
cask '1password'
cask 'aerial'
cask 'airserver'
cask 'alfred'
# cask 'amazon-drive'
cask 'atom'
cask 'avast-security'
cask 'bartender'
cask 'battle-net'
cask 'box-sync'
cask 'cleanmymac'
cask 'cyberduck'
cask 'dash'
cask 'docker'
cask 'docker-toolbox'
# cask 'dropbox'
cask 'encryptme'
cask 'evernote'
cask 'fantastical'
cask 'firefox'
# cask 'github-desktop'
cask 'gitkraken'
# cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'gpgtools'
cask 'graphiql'
cask 'hyper'
cask 'insomnia'
cask 'jasper'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'jetbrains-toolbox'
cask 'kaleidoscope'
cask 'kap'
cask 'keepingyouawake'
cask 'keybase'
cask 'kitematic'
cask 'lastpass'
cask 'little-snitch'
cask 'micro-snitch'
cask 'mirrordisplays'
cask 'moom'
cask 'mousepose'
cask 'muzzle'
cask 'ngrok'
cask 'now'
cask 'omnigraffle'
cask 'opera'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'screenflow'
cask 'sketch'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'softu2f'
cask 'sonos'
cask 'spotify'
# cask 'steam'
cask 'suspicious-package'
cask 'tower'
cask 'tripmode'
cask 'ubersicht'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vmware-fusion'
cask 'xquartz'
cask 'zoomus'

# Mac App Store ----------------------------------------------------------------
# mas 'Bear', id: 1091189122
# mas 'Boxy', id: 1053031090
mas 'Denied', id: 909257784
mas 'Electron APIs', id: 1119345146
mas 'Gifwit', id: 871200983
mas 'iConvert Icons', id: 515197296
mas 'Keynote', id: 409183694
mas 'LastPass', id: 926036361
# mas 'Lingon 3', id: 450201424
mas 'Mousepose', id: 405904955
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Simplify', id: 448003584
mas 'Speedtest by Ookla', id: 1153157709
mas 'The Unarchiver', id: 425424353
mas 'Xcode', id: 497799835
mas 'YubiKey Personalization Tool', id: 638161122
