# frozen_string_literal: true

cask_args appdir: '/Applications', require_sha: true

# brew tap
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap '1password/tap'

# brew install
brew 'coreutils'
brew 'duti'
brew 'gzip'
brew 'jq'
brew 'pigz'
brew 'pv'
brew 'tree'
brew 'zopfli'

brew 'ffmpeg'
brew 'imagemagick'
brew 'pandoc'

brew 'gh'
brew 'git'
brew 'git-extras'
brew 'git-lfs'
brew 'git-sizer'
brew 'gitmoji'
# brew 'git-svn'
# brew 'subversion'

brew 'gnupg'
brew 'openssh'
brew 'openssl'
brew 'pinentry-mac'
brew 'yubikey-agent'

brew 'go'
brew 'golangci-lint'
brew 'goreleaser'

brew 'node'
brew 'nvm'

brew 'rbenv'

brew 'ansible'
brew 'terraform'

brew 'python'
brew 'pipenv'
brew 'virtualenv'

# brew install --cask
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'apparency'
cask 'bartender'
cask 'cleanmymac'
cask 'cyberduck'
cask 'deckset'
cask 'docker'
cask 'elgato-camera-hub'
cask 'elgato-control-center'
cask 'elgato-stream-deck'
cask 'encryptme'
cask 'google-drive'
cask 'hookshot'
cask 'insomnia'
cask 'istat-menus'
cask 'kaleidoscope'
cask 'kap'
cask 'little-snitch'
cask 'lunar'
cask 'micro-snitch'
cask 'microsoft-auto-update'
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'mimestream'
cask 'mosaic'
cask 'muzzle'
# cask 'qlimagesize'
# cask 'qlmarkdown'
# cask 'qlvideo'
# cask 'quicklook-json'
# cask 'quicklookase'
cask 'postman'
cask 'rocket'
cask 'skitch'
cask 'spotify'
cask 'suspicious-package'
cask 'the-unarchiver'
cask 'tower'
cask 'tripmode'
cask 'ubersicht'
cask 'viscosity'
cask 'visual-studio-code'
cask 'yubico-yubikey-manager'

# (optional) brew install --cask
# cask 'citrix-workspace'
# cask 'java' unless system '/usr/libexec/java_home --failfast'
# cask 'microsoft-remote-desktop'
# cask 'obs'
# cask 'pingid'
# cask 'powershell'
# cask 'sonos'
# cask 'steam'
# cask 'visual-studio-code-insiders'
# cask 'vlc'
# cask 'vmware-fusion'

# mas install
brew 'mas'

mas '1Password for Safari', id: 1569813296
mas 'Bear', id: 1091189122
mas 'Black Out', id: 1319884285
mas 'Dato', id: 1470584107
mas 'Denied', id: 909257784
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
# mas 'Okta Extension App', id: 1439967473
mas 'Pages', id: 409201541
mas 'Speediness', id: 1596706466
mas 'We Love Lights', id: 1479422551
# mas 'Xcode', id: 497799835
